app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-02 05:02:29.446485"], ["status", ""], ["updated_at", "2015-02-02 05:02:29.446485"], ["user_id", ""]]
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

UPDATE "carts" SET "status" = ?, "updated_at" = ? WHERE "carts"."id" = 5  [["status", "paid"], ["updated_at", "2015-02-04 07:07:57.945155"]]
---
  def update
    respond_to do |format|
      if @cart.update(cart_params)

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
---
  def destroy
    @cart.destroy